In [1]:
import pandas as pd
import numpy as np
## https://www.youtube.com/watch?v=h4hOPGo4UVU&list=PLeo1K3hjS3uuASpe-1LjfG5f14Bnozjwy&index=9

Merge Dataframes

In [2]:
df1 = pd.DataFrame({
    'city': ['new york', 'chicago', 'orlando'],
    'temperature': [21,14,35]
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [3]:
df2 = pd.DataFrame({
    'city': ['chicago', 'new york', 'orlando'],
    'humidity': [65,68,75]
})
df2

       city  humidity
0   chicago        65
1  new york        68
2   orlando        75

In [4]:
## MERGING DF:
df3 = pd.merge(df1, df2, on='city')
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [6]:
df1 = pd.DataFrame({
    'city': ['new york', 'chicago', 'orlando', 'baltimore'],
    'temperature': [21,14,35,32]
})
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           32

In [7]:
df2 = pd.DataFrame({
    'city': ['chicago', 'new york', 'san francisco'],
    'humidity': [65,68,71]
})
df2

            city  humidity
0        chicago        65
1       new york        68
2  san francisco        71

In [8]:
## MERGING DF:
df3 = pd.merge(df1, df2, on='city')
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [9]:
## MERGING DF:
df3 = pd.merge(df1, df2, on='city', how='outer')
df3

            city  temperature  humidity
0       new york         21.0      68.0
1        chicago         14.0      65.0
2        orlando         35.0       NaN
3      baltimore         32.0       NaN
4  san francisco          NaN      71.0

In [10]:
## MERGING DF:
df3 = pd.merge(df1, df2, on='city', how='inner')
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [11]:
## MERGING DF:
df3 = pd.merge(df1, df2, on='city', how='left')
df3

        city  temperature  humidity
0   new york           21      68.0
1    chicago           14      65.0
2    orlando           35       NaN
3  baltimore           32       NaN

In [12]:
## MERGING DF:
df3 = pd.merge(df1, df2, on='city', how='right')
df3

            city  temperature  humidity
0        chicago         14.0        65
1       new york         21.0        68
2  san francisco          NaN        71

In [13]:
## MERGING DF:
df3 = pd.merge(df1, df2, on='city', how='outer', indicator='True')
df3

            city  temperature  humidity        True
0       new york         21.0      68.0        both
1        chicago         14.0      65.0        both
2        orlando         35.0       NaN   left_only
3      baltimore         32.0       NaN   left_only
4  san francisco          NaN      71.0  right_only